# далее: ВЧ - второе число, ПЧ - первое число, КВЧ - копия второго числа

# -------------------------
# копирование второго числа
# -------------------------

# -- первый шаг - переход к последней цифре ВЧ --
00, ,<,start
# -----------------------------------------------

# -- проход всего ВЧ до пробела, далее чтение первой цифры ВЧ --
start,0,<,start
start,1,<,start
start, ,>,read
# --------------------------------------------------------------

# -- чтение очередной цифры ВЧ и её затирание --
read,0, ,mv0
read,1, ,mv1
# ----------------------------------------------

# -- если всё уже скопировано, переход к работе с маской --
read, ,>,start_mask
# ---------------------------------------------------------

# -- сдвиг вправо с затёртой позиции --
mv0, ,>,cp0
mv1, ,>,cp1
# -------------------------------------

# -- движение по ВЧ с учётом копируемой цифры --
cp0,0,>,cp0
cp0,1,>,cp0
cp0, ,>,wr0

cp1,0,>,cp1
cp1,1,>,cp1
cp1, ,>,wr1
# ----------------------------------------------

# -- движение по уже скопированным цифрам и запись копируемой цифры в первой свободной ячейке --
wr0,0,>,wr0
wr0,1,>,wr0
wr0, ,0,ret0

wr1,0,>,wr1
wr1,1,>,wr1
wr1, ,1,ret1
# ----------------------------------------------------------------------------------------------

# -- обратное движение по копии --
ret0,0,<,ret0
ret0,1,<,ret0
ret0, ,<,-ret0

ret1,0,<,ret1
ret1,1,<,ret1
ret1, ,<,-ret1
# --------------------------------

# -- обратное движение по ВЧ и возврат затёртой цифры на своё место --
-ret0,0,<,-ret0
-ret0,1,<,-ret0
-ret0, ,0,mv

-ret1,0,<,-ret1
-ret1,1,<,-ret1
-ret1, ,1,mv
# --------------------------------------------------------------------

# -- сдвиг вправо на новую цифру и повтор копирования --
mv,0,>,read
mv,1,>,read
# ------------------------------------------------------


# ----------------------------
# процедура выделения разрядов
# ----------------------------

# --- первичные процедуры (повтор 1 раз) ---

# -- чтение первой цифры КВЧ и её затирание --
start_mask,1, ,sm1
start_mask,0, ,sm0
# --------------------------------------------

# -- перемещение по двум пробелам между ВЧ и КВЧ --
sm1, ,<,-sm1
-sm1, ,<,mv_vch_1
sm0, ,<,-sm0
-sm0, ,<,mv_vch_0
# -------------------------------------------------

# -- перемещение по ВЧ --
mv_vch_0,0,<,mv_vch_0
mv_vch_0,1,<,mv_vch_0
mv_vch_0, ,<,mv_pch_0

mv_vch_1,0,<,mv_vch_1
mv_vch_1,1,<,mv_vch_1
mv_vch_1, ,<,mv_pch_1
# -----------------------

# -- перемещение по ПЧ до первого пробела, смещение вправо и переход к основному циклу --
mv_pch_0,0,<,mv_pch_0
mv_pch_0,1,<,mv_pch_0
mv_pch_0, ,>,read_mask_0

mv_pch_1,0,<,mv_pch_1
mv_pch_1,1,<,mv_pch_1
mv_pch_1, ,>,read_mask_1
# ---------------------------------------------------------------------------------------

# --- процедуры основного цикла ---

# -- чтение очередной цифры ПЧ и её затирание --
# если 0, соответствующая цифра КВЧ в любом случае будет 0
read_mask_0,0, ,mv_null_val

# если 1, соответствующая цифра КВЧ сохраниться, значит, её нужно оставить в памяти
read_mask_0,1, ,mv_0_val

# если пробел, проход ПЧ окончен, переход к процедуре выхода из программы
read_mask_0, ,>,end

# аналогично предыдущему
read_mask_1,0, ,mv_null_val
read_mask_1,1, ,mv_1_val
read_mask_1, ,>,end
# ----------------------------------------------

# -- сдвиг с затёртой цифры вправо --
mv_null_val, ,>,null_val
mv_0_val, ,>,0_val
mv_1_val, ,>,1_val
# -----------------------------------

# -- движение по ПЧ вправо --
null_val,0,>,null_val
null_val,1,>,null_val
null_val, ,>,-null_val

0_val,0,>,0_val
0_val,1,>,0_val
0_val, ,>,-0_val

1_val,0,>,1_val
1_val,1,>,1_val
1_val, ,>,-1_val
# ---------------------------

# -- движение по ВЧ вправо --
-null_val,0,>,-null_val
-null_val,1,>,-null_val
-null_val, ,>,wr_null_val

-0_val,0,>,-0_val
-0_val,1,>,-0_val
-0_val, ,>,wr_0_val

-1_val,0,>,-1_val
-1_val,1,>,-1_val
-1_val, ,>,wr_1_val
# ----------------------------

# -- движение по КВЧ вправо и запись в первый пробел: --
# в любом случае 0, если прочитанная цифра ПЧ была 0
wr_null_val,0,>,wr_null_val
wr_null_val,1,>,wr_null_val
wr_null_val, ,0,ret_0

# 0, если проч. цифра ПЧ была 1 и здесь стоял 0
wr_0_val,0,>,wr_0_val
wr_0_val,1,>,wr_0_val
wr_0_val, ,0,ret_1

# 1, если проч. цифра ПЧ была 1 и здесь стояла 1
wr_1_val,0,>,wr_1_val
wr_1_val,1,>,wr_1_val
wr_1_val, ,1,ret_1
# ------------------------------------------------------

# -- сдвиг вправо на следующую цифру КВЧ --
ret_0,0,>,-ret_0
ret_1,0,>,-ret_1
ret_1,1,>,-ret_1
# -----------------------------------------

#  -- чтение очередной цифры КВЧ (аналогично первичной процедуре start_mask) и её затирание --
# если пробел, значит возвращаем последнюю цифру ПЧ и закругляемся
-ret_0,0, ,mv_ret_0
-ret_0,1, ,mv_ret_1
-ret_0, ,=,mv_ret_0
-ret_1,0, ,mv_ret_10
-ret_1,1, ,mv_ret_11
-ret_1, ,=,mv_ret_10
# --------------------------------------------------------------------------------------------

#  -- сдвиг влево с затёртой ячейки --
# с запоминанием конфигурации (ранее затёртая цифра ПЧ, только что прочитанная цифра КВЧ)
mv_ret_0, ,<,go_ret_0
mv_ret_1, ,<,go_ret_1
mv_ret_10, ,<,go_ret_10
mv_ret_11, ,<,go_ret_11
# ------------------------------------

# -- движение влево по КВЧ --
go_ret_0,0,<,go_ret_0
go_ret_0,1,<,go_ret_0
go_ret_0, ,<,-go_ret_0

go_ret_1,0,<,go_ret_1
go_ret_1,1,<,go_ret_1
go_ret_1, ,<,-go_ret_1

go_ret_10,0,<,go_ret_10
go_ret_10,1,<,go_ret_10
go_ret_10, ,<,-go_ret_10

go_ret_11,0,<,go_ret_11
go_ret_11,1,<,go_ret_11
go_ret_11, ,<,-go_ret_11
# --------------------------

# -- движение влево по ВЧ --
-go_ret_0,0,<,-go_ret_0
-go_ret_0,1,<,-go_ret_0
-go_ret_0, ,<,fin_ret_0

-go_ret_1,0,<,-go_ret_1
-go_ret_1,1,<,-go_ret_1
-go_ret_1, ,<,fin_ret_1

-go_ret_10,0,<,-go_ret_10
-go_ret_10,1,<,-go_ret_10
-go_ret_10, ,<,fin_ret_10

-go_ret_11,0,<,-go_ret_11
-go_ret_11,1,<,-go_ret_11
-go_ret_11, ,<,fin_ret_11
# -------------------------

# -- движение влево по ПЧ, запись возвращаемой цифры ПЧ --
fin_ret_0,0,<,fin_ret_0
fin_ret_0,1,<,fin_ret_0
fin_ret_0, ,0,move_0

fin_ret_1,0,<,fin_ret_1
fin_ret_1,1,<,fin_ret_1
fin_ret_1, ,0,move_1

fin_ret_10,0,<,fin_ret_10
fin_ret_10,1,<,fin_ret_10
fin_ret_10, ,1,move_0

fin_ret_11,0,<,fin_ret_11
fin_ret_11,1,<,fin_ret_11
fin_ret_11, ,1,move_1
# --------------------------------------------------------

# -- сдвиг с возвращённой цифры ПЧ и чтение следующей цифры ПЧ с учётом ранее прочитанной цифры КВЧ --
move_0,0,>,read_mask_0
move_0,1,>,read_mask_0

move_1,0,>,read_mask_1
move_1,1,>,read_mask_1
# ----------------------------------------------------------------------------------------------------

# -- финальное движение вправо по ВЧ --
end,0,>,end
end,1,>,end
end, ,>,-end
# -------------------------------------

# -- финальное движение вправо по КВЧ и выход из программы --
-end,0,>,-end
-end,1,>,-end
-end, ,#,-end
# -----------------------------------------------------------
